Res-firecracker-set-v8/firecracker_t_10_c_30_frontVcpu_8_wrkVcpu_1/wrk.txt
Running 1m test @ http://frontend:5000
  10 threads and 30 connections
  Thread calibration: mean lat.: 3201.143ms, rate sampling interval: 13336ms
  Thread calibration: mean lat.: 4144.135ms, rate sampling interval: 16703ms
  Thread calibration: mean lat.: 4923.115ms, rate sampling interval: 17465ms
  Thread calibration: mean lat.: 4921.223ms, rate sampling interval: 17481ms
  Thread calibration: mean lat.: 4947.584ms, rate sampling interval: 17465ms
  Thread calibration: mean lat.: 4083.229ms, rate sampling interval: 16515ms
  Thread calibration: mean lat.: 4944.009ms, rate sampling interval: 17186ms
  Thread calibration: mean lat.: 4926.026ms, rate sampling interval: 17432ms
  Thread calibration: mean lat.: 4128.420ms, rate sampling interval: 16433ms
  Thread calibration: mean lat.: 4931.897ms, rate sampling interval: 17350ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    25.09s    14.48s    0.94m    63.95%
    Req/Sec   411.96      4.40   425.00     86.96%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   22.07s 
 75.000%   36.34s 
 90.000%   46.63s 
 99.000%    0.94m 
 99.900%    0.97m 
 99.990%    0.98m 
 99.999%    0.98m 
100.000%    0.98m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.149     0.000000            1         1.00
    7544.831     0.100000        20645         1.11
   11952.127     0.200000        41326         1.25
   16007.167     0.300000        61952         1.43
   19382.271     0.400000        82576         1.67
   22069.247     0.500000       103270         2.00
   23855.103     0.550000       113545         2.22
   26902.527     0.600000       123885         2.50
   29835.263     0.650000       134179         2.86
   32833.535     0.700000       144544         3.33
   36339.711     0.750000       154864         4.00
   38010.879     0.775000       160064         4.44
   39616.511     0.800000       165180         5.00
   41287.679     0.825000       170339         5.71
   43024.383     0.850000       175537         6.67
   44761.087     0.875000       180615         8.00
   45645.823     0.887500       183295         8.89
   46628.863     0.900000       185848        10.00
   47742.975     0.912500       188373        11.43
   48988.159     0.925000       190944        13.33
   50233.343     0.937500       193523        16.00
   50790.399     0.943750       194872        17.78
   51347.455     0.950000       196119        20.00
   51937.279     0.956250       197434        22.86
   52625.407     0.962500       198689        26.67
   53444.607     0.968750       199992        32.00
   53805.055     0.971875       200614        35.56
   54165.503     0.975000       201262        40.00
   54591.487     0.978125       201913        45.71
   55017.471     0.981250       202570        53.33
   55476.223     0.984375       203210        64.00
   55738.367     0.985938       203553        71.11
   55934.975     0.987500       203837        80.00
   56164.351     0.989062       204168        91.43
   56393.727     0.990625       204530       106.67
   56590.335     0.992188       204833       128.00
   56721.407     0.992969       205000       142.22
   56852.479     0.993750       205134       160.00
   56983.551     0.994531       205293       182.86
   57147.391     0.995313       205472       213.33
   57311.231     0.996094       205632       256.00
   57376.767     0.996484       205711       284.44
   57442.303     0.996875       205776       320.00
   57540.607     0.997266       205861       365.71
   57638.911     0.997656       205947       426.67
   57737.215     0.998047       206021       512.00
   57802.751     0.998242       206068       568.89
   57868.287     0.998437       206109       640.00
   57933.823     0.998633       206143       731.43
   58032.127     0.998828       206189       853.33
   58097.663     0.999023       206223      1024.00
   58130.431     0.999121       206236      1137.78
   58195.967     0.999219       206263      1280.00
   58228.735     0.999316       206280      1462.86
   58261.503     0.999414       206297      1706.67
   58327.039     0.999512       206323      2048.00
   58359.807     0.999561       206340      2275.56
   58359.807     0.999609       206340      2560.00
   58392.575     0.999658       206352      2925.71
   58425.343     0.999707       206365      3413.33
   58458.111     0.999756       206373      4096.00
   58458.111     0.999780       206373      4551.11
   58490.879     0.999805       206382      5120.00
   58490.879     0.999829       206382      5851.43
   58523.647     0.999854       206394      6826.67
   58523.647     0.999878       206394      8192.00
   58556.415     0.999890       206406      9102.22
   58556.415     0.999902       206406     10240.00
   58556.415     0.999915       206406     11702.86
   58556.415     0.999927       206406     13653.33
   58556.415     0.999939       206406     16384.00
   58556.415     0.999945       206406     18204.44
   58589.183     0.999951       206415     20480.00
   58589.183     0.999957       206415     23405.71
   58589.183     0.999963       206415     27306.67
   58589.183     0.999969       206415     32768.00
   58589.183     0.999973       206415     36408.89
   58589.183     0.999976       206415     40960.00
   58589.183     0.999979       206415     46811.43
   58589.183     0.999982       206415     54613.33
   58589.183     0.999985       206415     65536.00
   58589.183     0.999986       206415     72817.78
   58589.183     0.999988       206415     81920.00
   58589.183     0.999989       206415     93622.86
   58621.951     0.999991       206417    109226.67
   58621.951     1.000000       206417          inf
#[Mean    =    25088.340, StdDeviation   =    14480.017]
#[Max     =    58589.184, Total count    =       206417]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  246326 requests in 1.00m, 101.86MB read
  Socket errors: connect 0, read 0, write 0, timeout 1
Requests/sec:   4105.74
Transfer/sec:      1.70MB